goal_app/app/controllers/goals_controller.rb

  def show
    @goal = Goal.find_by(id: params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save
---
INSERT INTO "goals" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 26], ["title", "First Goal"], ["created_at", "2018-09-14 23:16:43.509080"], ["updated_at", "2018-09-14 23:16:43.509080"]]

  def index
    @goals = Goal.all.to_a
---
SELECT "goals".* FROM "goals"

  def edit
    @goal = Goal.find_by(id: params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @goal = Goal.find_by(id: params[:id])
    if @goal.update(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["title", "New Goal"], ["updated_at", "2018-09-14 22:46:20.293742"], ["id", 7]]

  def destroy
    @goal = Goal.find_by(id: params[:id])
    @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 58]]